In [1]:
import pandas as pd

In [14]:
# Create a series of three different colours
car_Colours = pd.Series(["Green", "Red", "Yellow"])

In [15]:
car_Colours

0     Green
1       Red
2    Yellow
dtype: object

In [16]:

# Create a series of three different car types and view it
car_types = pd.Series(["Toyota", "Mercedes", "VW"])

In [17]:
car_types

0      Toyota
1    Mercedes
2          VW
dtype: object

In [19]:
# Combine the Series of cars and colours into a DataFrame
car_colours = pd.DataFrame({"Car Make": car_types, "Colour": car_Colours})

In [20]:
car_colours

   Car Make  Colour
0    Toyota   Green
1  Mercedes     Red
2        VW  Yellow

In [21]:
# Import data, rather than create it yourself
car_Colours = pd.read_csv("../Data/car-sales.csv")

In [22]:
car_Colours

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [23]:
# Export the DataFrame you created to a .csv file
car_Colours.to_csv("../Data/exported-car-Colours.csv")

In [24]:
# Find the different datatypes of the car data DataFrame
car_Colours.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [25]:
# Describe your current car sales DataFrame using describe()
car_Colours.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [26]:
# Get information about your DataFrame using info()
car_Colours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [28]:
# Create a Series of different numbers and find the mean of them
numbers = pd.Series([1998, 1992, 1993, 1988])
numbers.mean()

1992.75

In [29]:
# Create a Series of different numbers and find the sum of them
numbers = pd.Series([1998, 1992, 1993, 1988])
numbers.sum()

7971

In [30]:
# List out all the column names of the car sales DataFrame
car_Colours.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [31]:
# Find the length of the car sales DataFrame
len(car_Colours)

10

In [32]:
# Show the first 5 rows of the car sales DataFrame
car_Colours.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [33]:
# Show the first 7 rows of the car sales DataFrame
car_Colours.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [34]:
# Show the bottom 5 rows of the car sales DataFrame
car_Colours.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [35]:
# Use .loc to select the row at index 3 of the car sales DataFrame
car_Colours.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [36]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
car_Colours.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [37]:
## They are the same because iloc refers position while loc refers to index

In [38]:
# Select the "Odometer (KM)" column from the car sales DataFrame
car_Colours["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [ ]:
## Find the mean of the "Odometer (KM)" column in the car sales DataFrame
car_Colours["Odometer (KM)"]